Revit 2024 API
KeynoteEntry Members
The KeynoteEntry type exposes the following members.
Constructors
Name | Description
KeynoteEntry(String, String)
 Constructs a new KeynoteEntry from the given key name and keynote text. KeynoteEntry objects created from this constructor will not have parents.
KeynoteEntry(String, String, String)
 Constructs a new KeynoteEntry from the given key name, parent key name, and keynote text.
Methods
Name | Description
Dispose |  (Inherited from KeyBasedTreeEntry.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetChildrenKeys
 Gets a collection containing the keys of all children entry objects from this entry.
 (Inherited from KeyBasedTreeEntry.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from KeyBasedTreeEntry.)
Key
 The key of this entry.
 (Inherited from KeyBasedTreeEntry.)
KeynoteText
 The text associated with this KeynoteEntry.
ParentKey
 The parent key of this entry.
 (Inherited from KeyBasedTreeEntry.)
See Also
KeynoteEntry Class
Autodesk.Revit.DB Namespace